// This file is required by the index.html file and will
// be executed in the renderer process for that window.
// No Node.js APIs are available in this process because
// `nodeIntegration` is turned off. Use `preload.js` to
// selectively enable features needed in the rendering
// process.

var a = new Array("就这么迫不及待地想得到通关 Flag 吗？", "别急别急。", "要不先听我讲个故事吧。", "从前……", "从前有座山，", "山上有座庙。", "不要打断我嘛。", "我记性不好，打断了又要重新开始。", "从前有座山，", "山上有座庙。", "庙里有个和尚。", "他在讲故事：", "从前有座山，", "山上有座庙。", "庙里有个和尚。", "他在讲故事：", "从前有座山，", "山上有座庙。", "庙里有个和尚。", "他在讲故事：", "从前有座山，", "山上有座庙。", "庙里有个和尚。", "他在讲故事：", "从前有座山，", "山上有座庙。", "庙里有个和尚。", "他在讲故事：", "从前有座山，", "山上有座庙。", "庙里有个和尚。", "他在讲故事：", "从前有座山，", "山上有座庙。", "庙里有个和尚。", "他在讲故事...", "这么不耐烦的吗。", "哦？原来你听过这个故事。", "那我给你讲个阿拉丁神灯的故事吧？", "不想听？这么矫情。额。好吧，马上就给你 Flag。", "看你爪子动得越来越快就知道你真不耐烦了。", "再不给你 Flag，我觉得你妈妈会骂我。", "你爸爸会骂我。", "你爷爷会骂我。", "你奶奶会骂我", "你爷爷的爷爷会来找我。", "什么？觉得我废话多？", "好吧，撑到现在也不容易了。想放弃也可以的。", "什么？不知道怎么关闭这个程序？", "这都不会，还敢说自己是华师的呢。", "我教你吧。", "窗口右上角有个叉叉，点一下...", "不过，现在走了，你一定会后悔。", "下面重头戏来了，你不爱看戏？好吧，你还是滚吧。", "额。我又没礼貌了。被我妈知道，额，嘘嘘……", "闲着也是闲着不是吗？就算你强退出去也没事干不是吗？", "选择看完，这才是明智之选。", "纳尼？你要杀我灭口？", "好吧，不瞎扯了。", "说点正经的。", "分隔", "呆...", "tql", "sdl", "wsl", "既然是大佬，多陪我聊会天吧。", "今天是 1024", "[1][0][2][4] ... emmm", "你觉得这个活动好玩不//笑", "前面几关感觉如何。", "分隔", "不对这关我什么事前几关毕竟也不是我负责的。", "这一关其实也很简单的。", "真的很简单。", "真的！", "来，所谓终极考验不过如此：", "分隔", "嘿嘿嘿，再给你一次机会", "分隔", "这么聪明。", "终极考验不过如此，是吧。", "是不是刷贴吧刷多了什么套路都见过了//笑", "好了我这人很爽快的。", "这就给你 Flag。", "等我找找。", "马上回来！你先多点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "再点几下", "找到了！是 yymtql", "什么？你说啥？", "你说你不认识 yym？", "软协的锅长你都不认识？", "告诉你，要是这关过不了", "你就去找他算账", "哦哦哦你是说这个 Flag 不管用？", "不可能！", "绝对绝对不可能！", "肯定是你的打开方式不对！", "要是真是我的锅我就完蛋了", "//开发者删库跑路中", "分隔", "咦？又生气了？", "算了，不说这了。大家都是混日子的。", "换个话题。", "分隔", "不对不对这也不关我事。", "MD 你们快通关拿奖品了。", "我们呢，啥都没有得拿。", "不行不行，再换个话题。", "你没有听过“剑客”的故事？", "北风萧萧，残阳如血", "一位剑客临风而立……", "他的剑很冷……", "什么啊，你又听过。不跟你玩了。搞得自己是百晓生似的。", "你爷爷的，有骂我。", "好吧，我无聊，我逗逼好了吧，你想咋着？", "有种来 solo 啊。", "好吧，你是女生你不会。", "但是，没关系，我可以教你啊。", "以下由本大爷讲解，lol 打法。", "这里以狗头为例。", "现在 上单 基本就是瑞文 ，剑姬和诺克盖伦刀妹这些物理,还有timor流浪还有类似的其他ap", "对付物理看他打的怂不怂,他要是不怂你就猥琐。第一波兵可以适当补几个。不补都行，让兵线靠近你的塔下或者直接进塔都行", "因为狗头有 q 补兵，塔下补刀还是比较容易的 ", "用狗头的话，对付 vn 就是 5 级之前一怂到底。5 级的时候回家然后传送到线上直接干一波玩狗头必须补好刀狗头太依赖发育了", "玩狗头就一个字怂起来就是要怂要干的话就直接干疾跑引燃直接给", "要么就萎缩塔下 补刀 反正就是 用狗头 只有两种状态萎缩 当你感觉大的过的时候 技能全给 直接冲过去 ", "8级之前 千万不要抗兵线跟对面打反之 如果他抗兵线的话 你就跟他打", "为什么要等到别人越塔呢？自己能掌握主动不好吗 如果你把补变成疾跑 他越塔 你开疾跑他不是一样得死", "一句话，狗头不打辅助。", "好吧，我错了。我也没玩过狗头。", "//开发者：其实上面的内容全是从 GitHub 上抄的（逃", "好了好了马上就没弹窗了。再见。", "对了，最后啰嗦一句。", "在这里，祝大家在新的一学期里，身体棒棒的，学习棒棒的。", "男生要保护好腰子。", "对，是肾……", "真的是肾。", "还有头发……", "觉得我很无聊吧。嘻嘻，我也觉得是。", "那就先到这里吧。", "什么？你要 Flag？", "/*TODO*/", "//开发者删库跑路中...");
var b = new Array("你高数作业写完了吗？", "你英语作业写完了吗？", "你思修演讲准备好了吗？", "你 C 语言学完了吗？", "你洛谷刷完了吗？", "AK 杯打得怎么样啊？AK 了吗？", "分隔", "是不是很简单。", "分隔", "Il1lIIllIl1Il1I1l1IIlIl1IlllI1Il1IlllI1l1IIl1IIl1IIl1IIIlIIllllIl11lII1Ill 请问这里一共有多少个 I？", "分隔", "前面几关好玩吗？");
var q = new Array();


function say(t) {
    vex.dialog.alert({
        message: a[t],
        callback: function (value) {
            if (t < 59 || (t > 60 && t < 69) || (t > 70 && t < 75) || (t > 78 && t < 127) || (t > 128 && t < 131) || (t > 132 && t < 171)) {
                say(++t);
            }
            else if (t == 59) {
                ask(0);
            }
            else if (t == 69) {
                ask(7);
            }
            else if (t == 75 || t == 77) {
                ask(9);
            }
            else if (t == 131) {
                ask(11);
            }
        }
    })
}

function ask(u) {
    vex.dialog.prompt({
        message: b[u],
        placeholder: '',
        callback: function (value) {
            if (u < 5) {
                q[u] = value;
                ask(++u);
            }
            else if (u == 5 && q[0] == "写完了" && q[1] == "写完了" && q[2] == "准备好了" && q[3] == "学完了" && q[4] == "刷完了" && value == "我成功吊打加林哥") {
                say(61);
            }
            else if (u == 5) {
                say(129);
            }
            else if (u == 7) {
                say(71);
            }
            else if (u == 9) {
                if (value != 30) {
                    say(77);
                }
                else {
                    say(79);
                }
            }
            else if (u == 11){
                say(133);
            }
        }
    })
}

say(0);
